Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://127.0.0.1:8085"
  phases:
    - name: "Warm-up"
      duration: 10
      arrivalRate: 20
    - name: "Baseline Load Test (100 VU Peak)"
      duration: 60
      arrivalRate: 100
      maxVusers: 100
    - name: "Spike Test"
      duration: 20
      arrivalRate: 250
  plugins:
    metrics-by-endpoint: {}
  ensure:
    p95: 500
    maxErrorRate: 1

scenarios:
  - name: "Farmer Multi-Module Navigation Flow"
    flow:
      - get:
          url: "/index.html"
      - get:
          url: "/main_hub.html"
      - get:
          url: "/dashboard.html"
      - get:
          url: "/pest_watch_guidance.html"
      - get:
          url: "/climate_risk.html"
      - get:
          url: "/renting.html"
      - get:
          url: "/analytics.html"
      - get:
          url: "/market.html"
      - get:
          url: "/b2c_selling.html"
      - get:
          url: "/profile.html"
      - get:
          url: "/region.html"
      - get:
          url: "/api/health"
